{
  "bannerDescription":"Discover our ongoing research projects and explore our latest publications in Human-Computer Interaction and related fields.",  
  "projects": [
    {
      "id": "topic-1",
      "name": "Deepfake Literacy Intervention",
      "description": "Educating the public to recognize and respond to deepfake media.",
      "researchers": ["Dilki Sewwandi,", "Dilaxshini Dunstan"],
       "image": "/images/project1.png"
    },
    {
      "id": "topic-2",
      "name": "Enhancing adaptive user interfaces through realtime cognitive load detection",
      "description": "This research explores how Adaptive User Interfaces (AUIs) can be improved by integrating real-time cognitive load assessment to optimize user experience, reduce mental effort, and boost interaction quality. It focuses on detecting users' mental workload and dynamically adjusting interface elements-like layout and navigation-non-intrusively, making systems more intuitive and user-centered.",
      "researchers": ["Samudi Perera"],
      "image": "/images/project2.jpeg"
    },
    {
      "id": "topic-3",
      "name": "Explainable Abstractive Text Summarization Using Transformer and LSTM Architectures: A Comparative Study",
      "description": "This research focuses creating a LSTM-based and transformer-based explainable text summerization models  and conducting a comparative analysis on various metrics like explanation quality, summery quality and computational analysis.",
      "researchers": ["Nirasha Nelki"],
      "image": "/images/project3.png"
    },
    {
      "id": "topic-4",
      "name": "Designing a New AI-Integrated Development Methodology for Enhanced Efficiency",
      "description": "This research introduces a new software development methodology that integrates AI agents across all phases-like planning, coding, testing, and maintenance-to improve team productivity, reduce delivery time, and enhance code quality. The framework is designed to be adaptable for different project types and team sizes, positioning AI as an active collaborator in modern development practices.",
      "researchers": ["Nipun Bhathiya"],
      "image": "/images/project4.png"
    }
  ],
  "publications": [
    {
      "title": "End User Authoring of Personalized Content Classifiers: Comparing Example Labeling, Rule Writing, and LLM Prompting",
      "authors": "Leijie Wang, Kathryn Yurechko, Pranati Dani, Quan Ze (Jim) Chen, Amy Zhang",
      "venue": "CHI 2025",
      "description": "To make creating personal classifiers for content curation easier for such users, tools should support rapid initialization and iterative refinement. In this work, we then compare three strategies-(1) example labeling, (2) rule writing, and (3) large language model (LLM) prompting-for end users to build personal content classifiers in a lab experiment.",
      "pdf": "#"
    },
    {
      "title": "Title of the Research Paper",
      "authors": "Authors of the paper",
      "venue": "venue of the paper",
      "description": "Abstract of the research paper",
      "pdf": "#"
      
    }
  ]
}
